In [1]:
#Agenda
#Add 2 Series
#Add 2 DataFrames
#Use add() function
#Subtract a series from a DataFrame

In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
#Add 2 Series
ser_a= Series([100,200,300], index= ['a','b','c'])
print(ser_a)

a    100
b    200
c    300
dtype: int64

In [4]:
ser_b= Series([400,500,600,700], index= ['a','b','c','d'])
print(ser_b)

a    400
b    500
c    600
d    700
dtype: int64

In [5]:
ser_a + ser_b

a    500.0
b    700.0
c    900.0
d      NaN
dtype: float64

In [6]:
#Add 2 DataFrames
df1= DataFrame(np.arange(4).reshape(2,2), columns= ['a', 'b'], index= ['car','bike'])
print(df1)

      a  b
car   0  1
bike  2  3

In [7]:
df2= DataFrame(np.arange(9).reshape(3,3), columns= ['a', 'b','c'], index= ['car','bike','cycle'])
print(df2)

       a  b  c
car    0  1  2
bike   3  4  5
cycle  6  7  8

In [8]:
df1 + df2

         a    b   c
bike   5.0  7.0 NaN
car    0.0  2.0 NaN
cycle  NaN  NaN NaN

In [9]:
#Use add() function
df1= df1.add(df2, fill_value= 0)
print(df1)

         a    b    c
bike   5.0  7.0  5.0
car    0.0  2.0  2.0
cycle  6.0  7.0  8.0

In [10]:
#Subtract a series from a DataFrame
ser_c= df2.loc['car']
print(ser_c)

a    0
b    1
c    2
Name: car, dtype: int32

In [11]:
df2- ser_c

       a  b  c
car    0  0  0
bike   3  3  3
cycle  6  6  6